#include <stdio.h>
#include <string.h>
#include <ctype.h>
void Add_space(char *buff) // ฟังก์ชั่นเพิ่มช่องว่าง โดยจะแยก operater กับตัวแปรต่างๆที่อบู่ติดกันออกจากกัน
{
	char str[255]; //สร้างสตริงเพื่อเก็บค่าสตริงที่ได้ทำการแยก operater ออกจากตัวแปรต่างๆแล้ว
	int i,j; // สร้างตัวแปร integer 2 ตัวโดยใช้ i ในการวนรอบเช็ค operater จากสตริง buff และใช้ j นับจำนวนของสตริง str และไปเก็บไว้ในสตริง str
	for(i=0,j=0;i<strlen(buff);i++){ // เงื่อนไขที่เราจะสั่งให้มันทำคือมันต้องน้อยกว่าความยาวของสตริงเพราะตัวสุดท้ายของสตริงคือ NULL character 
		if(strchr("+-*/()^",buff[i])) // หา operater โดยวนรอบไปเรื่อยๆและเปรียบเทียบกับแต่ละตัวโดยในกรณีนี้คือถ้าเจอจะสั่งให้ทำด้านล่าง
		{
			str[j++] = ' '; // ถ้าเจอจะให้ตัวแรกของ str ซึ่งเป็นสตริงใหม่ที่เราสร้างขึ้นมาเพื่อเก็บเป็นเว้นวรรค
			str[j++] = buff[i]; // แล้วให้ตัวต่อมาเป็น operater
			str[j++] = ' '; // ตัวต่อมาเป็นเว้นวรรค
		}
		else 
			str[j++] = buff[i]; //ถ้าไม่ใช่ operater ก็ให้มันเป็นเหมือยเดิมไม่ต้องแยก
	}
	str[j++] = '\0'; // อันนี้เพิ่มเข้าไปเพราะตัวสุดท้ายเมื่อทำการทดสอบมันเพี้ยนเหมือนมันไม่แอด \0 ให้หลังจากจบการทำงานแล้วมีอักขระใหม่มา
	strcpy(buff,str); // เมื่อเสร็จก็ copy ข้อมูลของสตริงี่เราทำการแปลงแล้วกลับไปยังตัวเดิมเพื่อนำไปประมวลผลต่อ
}
int spilt(char *buff,char token[][20]) //ฟังก์ชั่นแยกแต่ละตัวเพื่อจะนำไปบอกว่าแต่ละตัวนั้นเป็นสตริงชนิดอะไร
{
	char *tok; // สร้าง pointer เพื่อชี้ตัวที่ต้องการแยก
	int count = 0; // สร้างตัวแปร จน.เต็มเพื่อเก็บค่าจำนวน
	tok = strtok(buff," "); // เป็นการให้ tok ชี้ไปที่ตำแหน่งเริ่มและเพิ่มไปเรื่อยๆโดยหา token ของสตริงจนกว่าจะเจอเว้นวรรคจึงหยุดโดยจะเติม \0 ให้อัตโนมัติ
	while(tok != NULL){ // ทำงานเมื่อ tok ไม่เท่ากับ \0
		strcpy(token[count++],tok); // copy ค่าสตริงที่อ่านมาได้มาเก็บไว้ใน token เพื่อจะเอาไปแสดงผลต่อ
		tok = strtok(NULL," "); //เช็คต่อจาก null ที่มันทำให้ก่อนหน้าเพราะ buff เพี้ยนไปแล้ว
	}
	return count; // รีเทิร์นค่าของ count กลับไปใน main เพิ่มนำไปวนรอบเช็คชนิดของสตริงต่อ
}
void Delete_space(char *buff){ //ฟังก์ช้่นเอาไว้ลบช่องว่างด้านหน้าและด้านหลังของสตริง เผื่อมีเหลืออยู่ก่อนจะทำไปหาชนิดของสตริง
	int i; // สร้างตัวแปร จน.เต็ม ไว้วนรอบ
	while(buff[0] == ' '){ //ถ้าด้านหน้าเป็นช่องว่าง
		for(i=0;i<strlen(buff);i++) // ให้วนรอบ ไปเรื่อยๆถ้า i ยังน้อยกว่าค่าความยางสตริง
			buff[i] = buff[i+1]; // ให้ตัวต่อไปมาเป็นตัวแรกแทนคือเราเว้นวรรคออกไป ถ้ามีเว้นวรรคอยู่อีกก็จะวนไปเรื่อยๆจนหมด
	}
	while(buff[strlen(buff)] == ' ') //ถัาตัวสุดท้ายของสตริงเป็นเว้นวรรค
		buff[strlen(buff)] = '\0'; // ให้ตัวสุดท้ายตัวนั้นเป็น NULL แทน
}
int check_operater(char *token){ // ฟังก์ชั่น check เครื่องหมายของสตริง
	if((strlen(token) == 1) && (strchr("+-/*()^",token[0]) != NULL)) //เงื่อนไขคือถ้าความยาวของมันเท่ากับ 1 มันจะไม่รวม \0 ก็คือมันต้องมี 1 ตัวและต้องเป็นเครื่องหมายที่เราต้องการด้วย
		return 1; // ถ้าใช่ รีเทิร์นค่าเท่ากับ 1
	else // ถ้าไม่ตรงกับเงื่อนไขด้านบน
		return 0; // รีเทิร์นค่าเท่ากับ 0
}
int check_number(char *token,double *number){ // ฟังก์ชั่นเช็คตัวเลข
	char ch; // สร้าง character มาเพื่ือหาค่าสตริงที่ต่อด้านหลัง
	if(sscanf(token,"%lf%c",number,&ch) == 1) // อ่านค่าจากสตริงที่ส่งมาต้องอ่านได้แค่ตัวแรกซึ่งเป้นเลขและต้องไม่เจอ character เลยสักตัว
		return 1; //ถ้าใช่รีเทิร์น 1
	else
		return 0; // ไม่ใช่รีเทิร์น 0

}
int check_function(char *token){ // ฟังก์ชั่นเช็คว่าเป็นฟังก์ชั่นไหม
	char fname[15][10] = {"sin","cos","tan","asin","acos","atan","sqrt","pow","log","exp"}; // สร้าง array 2 มิติมาเก็บค่าสตริงที่เป็นฟังก์ชั่น
	int i=0; // กำหนด ตัวแปรจำนวนเต็ม
	char buff[20]; //  สร้างสตริงเพื่อจะเอามาเปรียบเทียบ 
	strcpy(buff,token); // copy จากสตริงที่รับมาเปรียบไปอีกสตริงหนึ่ง
	strlwr(buff); // ให้ทุกตัวในสตริงเป็นตัวพิมเล็ก
	while(i<10 && strcmp(fname[i],buff) != 0) // เงื่อนไขคือให้เอาตัวที่มันรับมาไปเปรียบกับฟังก์ชั่นใน fname ว่ามีตรงกันไหม
		i++; // เพิ่มค่า i เพื่อวนรอบให้ครบทุกตัวใน fname มี 10 ตัว 
	if(i<10) // ถ้า i<0
		return 1; // รีเทิร์นค่า 1
	else // ถ้าไม่
		return 0; // รีเทิร์น 0 
}
int  check_iden(char *token){ // ฟังก์ชั่นเช็ค identifier
	int i; // สร้างตัวแปร i เพื่อวนค่า
	if((isalpha(token[0])) || token[0] == '_') // เช็คตัวหน้าสุดก่อนเลยว่ามันเป็น a-z,A-Z,_ หรือป่าว
	{
		for(i=1;i<strlen(token);i++){ // วนรอบเพื่อเช็ครอบ 2 จนกว่าจะน้อยกว่าความยาวสตริง
			if(!(isalpha(token[i]) || isdigit(token[i]) || token[i] == '_')) // ถ้ามันเป็น อักษร,ตัวเลข และ _ จะไม่ให้มันทำเพราะถ้าตัว identifier อยู่ตรงกลางแล้ว 
				return 0; // ถ้า เงื่อนไขเป็นจริงให้คืนค่า 0                              ไปเจอตัวพวกอักษร เลข _ อยู่ด้านหลัง มันจะเปลี่ยนค่าเป็น 1 แล้วรีเทิร์นออกมาว่าเป็น 
			}                                      //                           identifier
		return 1; // ไม่ใช่รีเทิร์น 0
		
	}
	else //ถ้าไม่ใช่ตั้งแต่เช็คครั้งแรก 
		return 0; // รีเทิร์น 0 
}
int main(){
	char str[255],buff[255],token[40][20]; // สร้างสตริงเพื่อเก็บค่าของข้อความ
	int count,i; // สร้างตัวแปร จน.เต็ม
	double number; // สร้างตัวแปร จน.จริง
	do{
	printf("\nWrite your command here : "); // สั่งให้แสดงผลข้อความ
	gets(str); // รับค่าสตริง EX. "ABC...." 
	if(strcmp(str,"end") != 0){ // เปรียบเทียบค่าสตริง กับคำว่า end ถ้ามันเหมือนกันจะไม่ทำคำสั่งใน if จะข้ามไปจบโปรแกรมเลย
		strcpy(buff,str); //copy ค่าสตริงจาก str มาไว้ใน buff
		strlwr(buff); // ให้สตริงใน buff ตัวเลขหมด
		Add_space(buff); // ให้ทำฟังก์ชั่นซึ่งจะแยก operater ออกจากข้อความอื่นๆ
		Delete_space(buff); // ลบเว้นวรรคหน้าหลังที่ยังเหลืออยู่
		printf("This is your Text : \"%s\"\n",buff); // ให้แสดงผลข้อความหลังจากทำฟังก์ชั่น addspace deletespace เสร็จ
		count = spilt(buff,token); // ให้ทำฟังก์ชั่น spilt แยกแต่ละตัวออกจากกันเพื่อจะทำไประบุชนิดสตริงและรีเทิร์นค่าจำนวนที่แยกออกมาเสร็จสิ้นให้ count
		printf("   ---- now,have %d string ----",count); //แสดงว่าเมื่อแยกเสร็จมีกี่ตัว
		for(i=0;i<count;i++){ // loop เพื่อเช็คชนิดสตริงของแต่ละตัว 
			printf("\ntoken %d) %s",i,token[i]); // แสดงข้อความที่แยกมาแต่ละตัว
			if(check_operater(token[i]) == 1) // เช็คว่าเป็น operater หรือไม่
				printf("\t\t%s is operater",token[i]); // ถ้าเป็นให้ปริ้นสตริงตัวนั้นออกมาอีกทีแล้วบอกว่าเป้น operater
			else if(check_number(token[i],&number) == 1) // เช็คว่าเป็นตัวเลขหรือไม่
				printf("\t\t%s is number",token[i]); // ถ้าเป็น ให้ปริ้นสตริงตัวนั้นออกมาอีกทีแล้วบอกว่าเป็น number
			else if(check_function(token[i]) == 1) // เช็คว่าเป็น ฟังก์ชั่นหรือไม่
				printf("\t\t%s is function",token[i]); // ถ้าเป็นให้ปริ้นสตริงตัวนั้นออกมาอีกทีแล้วบอกว่าเป็น function 
			else if(check_iden(token[i]) == 1) // เช็คว่าเป็น identifier หรือไม่
				printf("\t\t%s is Identifier",token[i]); // ถ้าเป็นให้ปริ้นสตริงตัวนั้นออกมาอีกทีแล้วบอกว่าเป็น identifier
			else // ถ้าไม่ใช่ที่กล่าวมาทั้งหมด
				printf("\t\t Error,can't specify"); // ให้แสดงข้อความ
				}
		}
	}while(strcmp(str,"end") != 0); // จะทำซ้ำเมื่อสตริง str กับ end ไม่เท่ากัน
	return 0; 
}